/******************************************************************************

d460. 山六九之旅

*******************************************************************************/
#include <iostream>

using namespace std;

int main()
{
    int age;
    cin >> age;
    
    if (age>=0 && age<=5){
        cout << "0";
    }
    if (age>=6 && age<=11){
        cout << "590";
    }
    if (age>=12 && age<=17){
        cout << "790";
    }
    if (age>=18 && age<=59){
        cout << "890";
    }
    if (age>=60){
        cout << "399";
    }

    return 0;
}

